var dataArray = [
  {
    'id': '0000',
    'title': 'Чому ви вирішили вивчати програмування?',
    'answers': [
      {
        'answer': 'Для своїх дітей',
        'link': '0001'
      },
      {
        'answer': 'Підзаробити',
        'link': '0002'
      },
      {
        'answer': 'Перевірити себе',
        'link': '0003'
      },
      {
        'answer': 'Мені цікаво',
        'link': '0003'
      },
      {
        'answer': 'Просто так',
        'link': '0003'
      },
      {
        'answer': 'Я не знаю, просто порадьте мені мову',
        'link': '0016'
      }
    ]
  },
  {
    'id': '0001',
    'title': 'Почніть з основ.',
    'answers': [
      {
        'answer': 'А потім ...',
        'link': '0016'
      }
    ]
  },
  {
    'id': '0002',
    'title': 'Заробити?',
    'answers': [
      {
        'answer': 'Знайти роботу',
        'link': '0004'
      },
      {
        'answer': 'Є ідея для стартапу',
        'link': '0005'
      }
    ]
  },
  {
    'id': '0004',
    'title': 'Платформа/Область',
    'answers': [
      {
        'answer': 'Хочу працювати в великій технічній компанії',
        'link': '0006'
      },
      {
        'answer': 'Мені все рівно! Просто хочу $$$$',
        'link': '0018'
      },
      {
        'answer': 'WEB',
        'link': '0007'
      },
      {
        'answer': 'Ентерпрайз',
        'link': '0010'
      },
      {
        'answer': 'Мобільні девайси',
        'link': '0009'
      },
      {
        'answer': '3D/Ігри',
        'link': '0024'
      }
    ]
  },
  {
    'id': '0006',
    'title': 'Оберіть компанію',
    'answers': [
      {
        'answer': 'Facebook',
        'link': '0016'
      },
      {
        'answer': 'Windows',
        'link': '0019'
      },
      {
        'answer': 'Google',
        'link': '0016'
      },
      {
        'answer': 'Apple',
        'link': '0023'
      }
    ]
  },
  {
    'id': '0007',
    'title': 'Оберіть напрямок',
    'answers': [
      {
        'answer': 'Front-end',
        'link': '0017'
      },
      {
        'answer': 'Back-end',
        'link': '0008'
      }
    ]
  },
  {
    'id': '0008',
    'title': 'Хочу працювати в ...',
    'answers': [
      {
        'answer': '...корпорації',
        'link': '0010'
      },
      {
        'answer': '...стартапі',
        'link': '0011'
      }
    ]
  },
  {
    'id': '0010',
    'title': 'Як ви відноситесь до Microsoft?',
    'answers': [
      {
        'answer': 'Фанат',
        'link': '0019'
      },
      {
        'answer': 'Норм',
        'link': '0018'
      },
      {
        'answer': 'Отстой',
        'link': '0018'
      }
    ]
  },
  {
    'id': '0009',
    'title': 'Яка ОС вас цікавить?',
    'answers': [
      {
        'answer': 'iOS',
        'link': '0023'
      },
      {
        'answer': 'Android',
        'link': '0018'
      }
    ]
  },
  {
    'id': '0011',
    'title': 'Хочете спробувати щось нове, з величезним потенціалом?',
    'answers': [
      {
        'answer': 'так',
        'link': '0017'
      },
      {
        'answer': 'ні',
        'link': '0012'
      },
      {
        'answer': 'не впевнений',
        'link': '0012'
      }
    ]
  },
  {
    'id': '0012',
    'title': 'Яка ваша улюблена іграшка?',
    'answers': [
      {
        'answer': 'Пластилін',
        'link': '0021'
      },
      {
        'answer': 'Lego',
        'link': '0016'
      },
      {
        'answer': 'Стара, потворна іграшка, але я її обожнюю',
        'link': '0022'
      }
    ]
  },
  {
    'id': '0005',
    'title': 'Під яку платформу/напрямок?',
    'answers': [
      {
        'answer': '3D/Ігри',
        'link': '0024'
      },
      {
        'answer': 'Мобільні девайси',
        'link': '0009'
      },
      {
        'answer': 'Ентерпрайз',
        'link': '0010'
      },
      {
        'answer': 'WEB',
        'link': '0013'
      }
    ]
  },
  {
    'id': '0013',
    'title': 'Ваш доданок працює в режимі реального часу?',
    'answers': [
      {
        'answer': 'так',
        'link': '0017'
      },
      {
        'answer': 'ні',
        'link': '0011'
      }
    ]
  },
  {
    'id': '0003',
    'title': 'Придумали круту ідею?',
    'answers': [
      {
        'answer': 'так',
        'link': '0005'
      },
      {
        'answer': 'ні, просто хочу почати',
        'link': '0014'
      }
    ]
  },
  {
    'id': '0014',
    'title': 'Хочу вивчати щось нове ...',
    'answers': [
      {
        'answer': 'бажано швидко',
        'link': '0016'
      },
      {
        'answer': 'головне щоб правильно',
        'link': '0016'
      },
      {
        'answer': 'трошки попотіти/понапрягатись',
        'link': '0015'
      },
      {
        'answer': 'самим складним шляхом і щоб сформувати базу для переходу на іншу мову',
        'link': '0024'
      }
    ]
  },
  {
    'id': '0015',
    'title': 'Авто чи механічна КПП?',
    'answers': [
      {
        'answer': 'Автомат',
        'link': '0018'
      },
      {
        'answer': 'Механаніка',
        'link': '0020'
      }
    ]
  },
  {
    'id': '0016',
    'title': 'Python'
  },
  {
    'id': '0017',
    'title': 'JavaScript'
  },
  {
    'id': '0018',
    'title': 'Java'
  },
  {
    'id': '0019',
    'title': 'C#'
  },
  {
    'id': '0020',
    'title': 'C'
  },
  {
    'id': '0021',
    'title': 'Ruby'
  },
  {
    'id': '0022',
    'title': 'PHP'
  },
  {
    'id': '0023',
    'title': 'Objective-C'
  },
  {
    'id': '0024',
    'title': 'C++'
  }
];
